{
  "courses": [{"number": "CS 1", "course name": "Introduction to Computer Programming",
                           "professor": "Hovik",
                          "description": "A course on computer programming emphasizing the program design process and pragmatic programming skills. It will use the Python programming language and will not assume previous programming experience."},
  {"number": "CS 2", "course name": "Introduction to Programming Methods", 
            "professor" : "Blank", 
            "description": "CS 2 is a demanding course in programming languages and computer science. Topics covered include data structures, including lists, trees, and graphs; implementation and performance analysis of fundamental algorithms; algorithm design principles, in particular recursion and dynamic programming."},
  {"number": "CS 3", "course name": "Introduction to Software Design", 
            "professor": "Blank", 
            "description": "CS 3 is a practical introduction to designing large programs in a low-level language. Heavy emphasis is placed on documentation, testing, and software architecture. Students will work in teams in two 5-week long projects."},
  {"number": "CS 4", "course name": "Fundamentals of Computer Programming", 
            "professor": "Vanier", 
            "description": "This course gives students the conceptual background necessary to construct and analyze programs, which includes specifying computations, understanding evaluation models, and using major programming language constructs (functions and procedures, conditionals, recursion and looping, scoping and environments, compound data, side effects, higher-order functions and functional programming, and object-oriented programming)."},
  {"number": "MA 6a", "course name": "Introduction to Discrete Mathematics", 
                  "professor": "T.Yu, Gherman, Kechris", 
                  "description": "First term: a survey emphasizing graph theory, algorithms, and applications of algebraic structures. Graphs: paths, trees, circuits, breadth-first and depth-first searches, colorings, matchings. Enumeration techniques; formal power series; combinatorial interpretations. "},
  {"number": "CS 12", "course name": "Student-Taught Topics in Computing", 
            "professor": "Staff", 
            "description": "Each section covers a topic in computing with associated sets or projects. Sections are designed and taught by an undergraduate student under the supervision of a CMS faculty member."},
  {"number": "CS 21", "course name": "Decidability and Tractability", 
            "professor": "Umans", 
            "description": "This course introduces the formal foundations of computer science, the fundamental limits of computation, and the limits of efficient computation. Topics will include automata and Turing machines, decidability and undecidability, reductions between computational problems, and the theory of NP-completeness."},
  {"number": "CS 24", "course name": "Introduction to Computing Systems", 
            "professor": "Blank", 
            "description": "Basic introduction to computer systems, including hardware-software interface, computer architecture, and operating systems. Course emphasizes computer system abstractions and the hardware and software techniques necessary to support them, including virtualization (e.g., memory, processing, communication), dynamic resource management, and common-case optimization, isolation, and naming."},
  {"number": "CS 38", "course name": "Algorithms", 
            "professor": "Schröder", 
            "description": "This course introduces techniques for the design and analysis of efficient algorithms. Major design techniques (the greedy approach, divide and conquer, dynamic programming, linear programming) will be introduced through a variety of algebraic, graph, and optimization problems."},
  {"number": "Ec/ACM/CS 112", "course name": "Bayesian Statistics", 
                    "professor": "Rangel", 
                    "description": "This course provides an introduction to Bayesian Statistics and its applications to data analysis in various fields. Topics include: discrete models, regression models, hierarchical models, model comparison, and MCMC methods."},
  {"number": "CS/IDS 121", "course name": "Relational Databases", 
                  "professor": "Hovik", 
                  "description": "Introduction to the basic theory and usage of relational database systems. It covers the relational data model, relational algebra, and the Structured Query Language (SQL). The course introduces the basics of database schema design and covers the entity-relationship model, functional dependency analysis, and normal forms."},
  {"number":  "CS 130", "course name": "Software Engineering",
              "professor": "Pinkston",
              "description": "This course presents a survey of software engineering principles relevant to all aspects of the software development lifecycle. Students will examine industry best practices in the areas of software specification, development, project management, testing, and release management, including a review of the relevant research literature."},
  {"number": "CS 132","course name": "Web Development",
              "professor": "Hovik", 
              "description": "Covers full-stack web development with HTML5, CSS, client-side JS (ES6) and server-side JS (Node.js/Express) for web API development. Concepts including separation of concerns, the client-server relationship, user experience, accessibility, and security will also be emphasized throughout the course."},
  {"number": "EE 148", "course name": "Advanced Topics in Vision: Large Language and Vision Models",
                    "professor": "Perona, Gkioxari",
                    "description": "The class will focus on large language models (LLMs) and language-and-vision models, as well as on generative methods for artificial intelligence (AI). Topics include deep neural networks,transformers, large language models, generative adversarial networks, diffusion models, and applications of such architectures and methods to image analysis, image synthesis, and text-to-image translation."},
  {"number": "CMS 155", "course name": "Machine Learning & Data Mining",
                            "professor": "Yue",
                            "description": "This course will cover popular methods in machine learning and data mining, with an emphasis on developing a working understanding of how to apply these methods in practice. The course will focus on basic foundational concepts underpinning and motivating modern machine learning and data mining approaches."},
  {"number": "CS 156ab", "course name": "Learning Systems",
                        "professor": "Abu-Mostafa",
                        "description": "Introduction to the theory, algorithms, and applications of automated learning. How much information is needed to learn a task, how much computation is involved, and how it can be accomplished."} 
  ]
}
